Revit 2024 API
ExternalApplicationArray.IsEmpty Property
Test to see if the array is empty.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual bool IsEmpty { get; }
Visual Basic
Public Overridable ReadOnly Property IsEmpty As Boolean
	Get
Visual C++
public:
virtual property bool IsEmpty {
	bool get ();
}
Remarks
If the array is empty then True will be returned, otherwise False.
See Also
ExternalApplicationArray Class
Autodesk.Revit.UI Namespace